src/Notes/汉书百官公卿表.org
#+TITLE: 汉书百官公卿表
#+OPTIONS: ^:nil num:nil H:1
#+TAGS: 历史(h) 古籍(o) 汉书

* 三公
** 相国、丞相（大司徒）
秦官​金印紫绶，掌丞天子助理万机。​有两长史，秩千石​秦有左右，高帝即位，置一丞相，十一年更名相国，绿绶。孝惠、高后置左右丞相，文帝二年复置一丞相。​哀帝元寿二年更名大司徒。
** 太尉（大司马、将军）
秦官​金印紫授，掌武事。​有长史，秩千石。​武帝建元二年省。元狩四年初置大司马，以冠将军之号，宣帝地节三年置大司马，不冠将军，亦元印绶官属。成帝绥和元年初赐在司马金印紫绶，置官属，禄比丞相，去将军。哀帝建平二年复去大司马印绶、官属，冠将军如故。元寿二年复赐大司马印绶，置官属，去将军，位在司徒上。
** 御史大夫（大司空、御史中丞）
秦官​位上卿，银印青绶，掌副丞相。一曰中丞，在殿中兰台，掌图籍秘书，外督部刺史，内领侍御史员十五人，受公卿奏事，举劾按章。​有两丞，秩千石。​成帝绶和元年更名大司空，金印紫绶，禄比丞相，置长史如中丞，官职如故。哀帝建平二年复为御史大夫，元寿二年复为大司空，御史中丞更名御史长史。
** 太傅、太师、太保（古官三公）
古官​金印紫绶。​太傅，高后元年初置。后省，八年复置。哀帝元寿二年复置。位在三公上。太师、太保，平帝元始元年皆初置。太师位在太傅上，太保次太傅。
* 九卿
** 奉常（太常、秩宗）
秦官​掌宗庙礼仪，有丞。​景帝中六年更名太常。王莽改太常曰秩宗。
*** 六令丞
**** 太乐
掌伎乐
**** 太祝
掌祭祀​景帝中六年更名太祝为祠祀，武帝太初元年更曰庙祀，初置太卜。
**** 太宰
掌膳食
**** 太史
掌天时星历
**** 太卜
掌占卜
**** 太医
掌医药
*** 两长丞
**** 都水
总掌治水
**** 均官
掌均输
*** 诸庙寝园食官令长丞
*** 雍五畤相关
**** 雍太宰
**** 雍太祝
**** 五畤尉
*** 博士
秦官​博古通今，备顾问，传授儒学。​​秩比六百石，员多至数十人。武帝建元五年初置《五经》博士，宣帝黄龙元年稍增员十二人。
*** 诸陵县
掌陵寝诸事​元帝永光元年分诸陵邑属三辅。
** 郎中令（光禄勋）
秦官​掌宫殿掖门户，有丞。​武帝太初元年更名光禄勋。
*** 大夫
掌论议，有太中大夫、中大夫、谏大夫，皆无员，多至数十人。
**** 太中大夫
太中大夫秩比千石
**** 中大夫
太初元年更名中大夫为光禄大夫，秩比二千石
**** 谏大夫
武帝元狩五年初置谏大夫，秩比八百石
*** 郎
掌守门户，出充车骑，有议郎、中郎、侍郎、郎中，皆无员，多至千人。
**** 议郎
秩比六百石
**** 中郎
秩比六百石
***** 五官、左、右三将
秩皆比二千石
**** 侍郎
秩比四百石
**** 郎中
秩比三百石
***** 车、户、骑三将
秩皆比千石
*** 谒者
掌宾讚受事​员七十人，秩比六百石
**** 谒者仆射
秩比千石
*** 期门（虎贲郎）
掌执兵送从。​比郎，无员，多至千人。武帝建元三年初置，平帝元始元年更名虎贲郎。
**** 期门仆射
秩比千石
**** 虎贲中郎将
秩比二千石
*** 羽林
掌送从，次期门。​羽林有令丞。​武帝太初元年初置，名曰建章营骑，后更名羽林骑。又取从军死事之子孙养羽林，官教以五兵，号曰羽林孤儿。宣帝令中郎将、骑都尉监羽林，秩比二千石。
** 卫尉（中大夫令）
秦官​掌宫门卫屯兵，有丞。​景帝初更名中大夫令，后元年复为卫尉。
*** 公车司马
*** 卫士
*** 旅贲
*** 诸屯卫候
*** 司马二十二官
*** 长乐卫尉
*** 建章卫尉
*** 甘泉卫尉
** 太仆
秦官​掌舆马，有两丞。​​秩中二千石。
*** 太厩
五丞一尉
*** 未央
五丞一尉​未央厩令
*** 家马（挏马）
五丞一尉​主供天子私用，非大祀戎事军国所需，故谓之家马也。​武帝太初元年更名家马为挏马，初置路。
四令丞
**** 车府
**** 路
厩名​，在未央宫。
**** 骑马
厩名​，在长安城外。
**** 骏马
*** 五监长丞
龙马、闲驹、橐泉、騊駼、承华龙马，大宛厩也。闲驹，养马之所​。橐泉，厩名，在橐泉宫下。騊駼，厩名，在长安城外。承华，厩名。
*** 边郡六牧师苑令
陇西、天水、安定、北地、上郡、西河六郡
*** 牧橐令丞
牧养骆驼
*** 昆蹄令丞
良马厩
*** 中太仆
掌皇太后舆马，不常置也。
** 廷尉（大理、作士）
秦官​掌刑辟。​​秩中二千石。​有正、左右监，秩皆千石。​景帝中六年更名大理，武帝建元四年复为廷尉。宣帝地节三年初置左右平，秩皆六百石。帝元寿二年复为大理。王莽改曰作士。
** 典客（大行令、大鸿胪、典乐）
秦官​掌诸归义蛮夷，有丞。​​秩中二千石。​景帝中六年更名大行令，武帝太初元年更名大鸿胪。王莽改大鸿胪曰典乐。
*** 行人
武帝太初元年更名行人为大行令
*** 译官
*** 别火
狱令，主治改火之事。​武帝太初元年，初置别火。
*** 郡邸长丞
诸郡在京师之邸，郡国朝宿之舍。​初，置郡国邸属少府，中属中尉，后属大鸿胪。
** 宗正
秦官​掌亲属，有丞。​​秩中二千石。​平帝元始四年更名宗伯。​王莽并其官于秩宗。
*** 都司空令丞
都造砖瓦，用以修葺宫殿及各城门楼
*** 内官长丞
初，内官属少府，中属主爵，后属宗正。
*** 公主家令
*** 公主门尉
** 治粟内史（大农令、大司农）
秦官。​掌谷货，有两丞。​​秩中二千石。​景帝后元年更名大农令，武帝太初元年更名大司农。王莽改大司农曰羲和，后更为纳言。
*** 五令丞
**** 太仓
京城储粮大仓
**** 均输
统一征收，买卖和运输货物，以调剂各地需求，郡国设均输官。
**** 平准
官府转输物资，平抑物价，由平准令掌管。
**** 都内
主管贡献方物及货币
**** 籍田
初为帝王亲耕，并设仓，后因仓设官。
*** 两长丞
**** 干官
掌铸钱事。​初，斡官属少府，中属主爵，后属大司农。
**** 铁市
*** 郡国诸仓
*** 农监
*** 都水六十五官长丞
*** 搜粟都尉
武帝军官，不常置。
** 少府
秦官​掌山海池泽之税，以给供养，有六丞。​​秩中二千石。​王莽改少府曰共工。
*** 十六官令丞
**** 尚书
初掌殿内文书，后掌群臣章奏。
**** 符节
掌符节之事。
**** 太医
主治宫廷人员之病。
**** 太官
掌膳食，兼掌四时进献果实。​太官七丞。
**** 汤官
供饼饵果实。
**** 导官
掌御用粮食。
**** 乐府
主管宫廷、巡行、祭祀之音乐，兼采民歌及配曲。​乐府三丞。​绥和二年，哀帝省乐府。
**** 若庐
主治库兵及诏狱。
