Blog/汉书百官公卿表.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-15 Fri 01:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>汉书百官公卿表</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/static/css/default.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <nav>言窟</nav>
    <ul class="menu">
        <li><a href="/">Index</a></li>
        <li><a href="/Photo/index.html">Photo</a></li>
        <li><a href="https://github.com/autumnc">Github</a></li>
        <li><a href="/about.html">About</a></li>
    </ul>
</header>
</div>
<div id="content">
<h1 class="title">汉书百官公卿表</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga904f20">三公</a></li>
<li><a href="#org018d827">九卿</a></li>
<li><a href="#org1b6e2af">中尉（执金吾）</a></li>
<li><a href="#orgbd669e8">太子太傅、少傅</a></li>
<li><a href="#orgf14ca67">将作少府（将作大匠）</a></li>
<li><a href="#org444e160">詹事</a></li>
<li><a href="#org9e15f75">将行（大长秋）</a></li>
<li><a href="#orga0f02f7">典属国</a></li>
<li><a href="#orgfdb3535">水衡都尉</a></li>
<li><a href="#orgcc6f9ec">三辅</a></li>
<li><a href="#orgbc2ba1b">武职</a></li>
<li><a href="#org2271665">中朝官（内朝官）</a></li>
<li><a href="#orgd466595">监御史（刺史、牧）</a></li>
<li><a href="#orga459796">郡县</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga904f20" class="outline-2">
<h2 id="orga904f20">三公</h2>
<div class="outline-text-2" id="text-orga904f20">
</div>
<ul class="org-ul">
<li><a id="orgaf3a0e4"></a>相国、丞相（大司徒）<br />
<div class="outline-text-3" id="text-orgaf3a0e4">
<p>
秦官​金印紫绶，掌丞天子助理万机。​有两长史，秩千石​秦有左右，高帝即位，置一丞相，十一年更名相国，绿绶。孝惠、高后置左右丞相，文帝二年复置一丞相。​哀帝元寿二年更名大司徒。
</p>
</div>
</li>
<li><a id="orgd9d8064"></a>太尉（大司马、将军）<br />
<div class="outline-text-3" id="text-orgd9d8064">
<p>
秦官​金印紫授，掌武事。​有长史，秩千石。​武帝建元二年省。元狩四年初置大司马，以冠将军之号，宣帝地节三年置大司马，不冠将军，亦元印绶官属。成帝绥和元年初赐在司马金印紫绶，置官属，禄比丞相，去将军。哀帝建平二年复去大司马印绶、官属，冠将军如故。元寿二年复赐大司马印绶，置官属，去将军，位在司徒上。
</p>
</div>
</li>
<li><a id="org5de5040"></a>御史大夫（大司空、御史中丞）<br />
<div class="outline-text-3" id="text-org5de5040">
<p>
秦官​位上卿，银印青绶，掌副丞相。一曰中丞，在殿中兰台，掌图籍秘书，外督部刺史，内领侍御史员十五人，受公卿奏事，举劾按章。​有两丞，秩千石。​成帝绶和元年更名大司空，金印紫绶，禄比丞相，置长史如中丞，官职如故。哀帝建平二年复为御史大夫，元寿二年复为大司空，御史中丞更名御史长史。
</p>
</div>
</li>
<li><a id="org9e2a1b8"></a>太傅、太师、太保（古官三公）<br />
<div class="outline-text-3" id="text-org9e2a1b8">
<p>
古官​金印紫绶。​太傅，高后元年初置。后省，八年复置。哀帝元寿二年复置。位在三公上。太师、太保，平帝元始元年皆初置。太师位在太傅上，太保次太傅。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org018d827" class="outline-2">
<h2 id="org018d827">九卿</h2>
<div class="outline-text-2" id="text-org018d827">
</div>
<ul class="org-ul">
<li><a id="org5b3f7d1"></a>奉常（太常、秩宗）<br />
<div class="outline-text-3" id="text-org5b3f7d1">
<p>
秦官​掌宗庙礼仪，有丞。​景帝中六年更名太常。王莽改太常曰秩宗。
</p>
</div>
<ul class="org-ul">
<li><a id="orgeff43aa"></a>六令丞<br />
<ul class="org-ul">
<li><a id="org7037fbd"></a>太乐<br />
<div class="outline-text-5" id="text-org7037fbd">
<p>
掌伎乐
</p>
</div>
</li>
<li><a id="orgfed3b31"></a>太祝<br />
<div class="outline-text-5" id="text-orgfed3b31">
<p>
掌祭祀​景帝中六年更名太祝为祠祀，武帝太初元年更曰庙祀，初置太卜。
</p>
</div>
</li>
<li><a id="orgc7792d0"></a>太宰<br />
<div class="outline-text-5" id="text-orgc7792d0">
<p>
掌膳食
</p>
</div>
</li>
<li><a id="orge3dddd5"></a>太史<br />
<div class="outline-text-5" id="text-orge3dddd5">
<p>
掌天时星历
</p>
</div>
</li>
<li><a id="orgf89f78a"></a>太卜<br />
<div class="outline-text-5" id="text-orgf89f78a">
<p>
掌占卜
</p>
</div>
</li>
<li><a id="org08a9a72"></a>太医<br />
<div class="outline-text-5" id="text-org08a9a72">
<p>
掌医药
</p>
</div>
</li>
</ul>
</li>
<li><a id="orgcad4be1"></a>两长丞<br />
<ul class="org-ul">
<li><a id="org56507a4"></a>都水<br />
<div class="outline-text-5" id="text-org56507a4">
<p>
总掌治水
</p>
</div>
</li>
<li><a id="org884564b"></a>均官<br />
<div class="outline-text-5" id="text-org884564b">
<p>
掌均输
</p>
</div>
</li>
</ul>
</li>
<li><a id="org15af806"></a>诸庙寝园食官令长丞<br /></li>
<li><a id="org42b2bf4"></a>雍五畤相关<br />
<ul class="org-ul">
<li><a id="org8b68612"></a>雍太宰<br /></li>
<li><a id="org8fea63c"></a>雍太祝<br /></li>
<li><a id="orgaf3b121"></a>五畤尉<br /></li>
</ul>
</li>
<li><a id="org27f3641"></a>博士<br />
<div class="outline-text-4" id="text-org27f3641">
<p>
秦官​博古通今，备顾问，传授儒学。​​秩比六百石，员多至数十人。武帝建元五年初置《五经》博士，宣帝黄龙元年稍增员十二人。
</p>
</div>
</li>
<li><a id="org72f8ad4"></a>诸陵县<br />
<div class="outline-text-4" id="text-org72f8ad4">
<p>
掌陵寝诸事​元帝永光元年分诸陵邑属三辅。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org4715cf4"></a>郎中令（光禄勋）<br />
<div class="outline-text-3" id="text-org4715cf4">
<p>
秦官​掌宫殿掖门户，有丞。​武帝太初元年更名光禄勋。
</p>
</div>
<ul class="org-ul">
<li><a id="orgb22fdb8"></a>大夫<br />
<div class="outline-text-4" id="text-orgb22fdb8">
<p>
掌论议，有太中大夫、中大夫、谏大夫，皆无员，多至数十人。
</p>
</div>
<ul class="org-ul">
<li><a id="orgbdc1822"></a>太中大夫<br />
<div class="outline-text-5" id="text-orgbdc1822">
<p>
太中大夫秩比千石
</p>
</div>
</li>
<li><a id="orgc8aeec4"></a>中大夫<br />
<div class="outline-text-5" id="text-orgc8aeec4">
<p>
太初元年更名中大夫为光禄大夫，秩比二千石
</p>
</div>
</li>
<li><a id="org124b57b"></a>谏大夫<br />
<div class="outline-text-5" id="text-org124b57b">
<p>
武帝元狩五年初置谏大夫，秩比八百石
</p>
</div>
</li>
</ul>
</li>
<li><a id="org5a98f90"></a>郎<br />
<div class="outline-text-4" id="text-org5a98f90">
<p>
掌守门户，出充车骑，有议郎、中郎、侍郎、郎中，皆无员，多至千人。
</p>
</div>
<ul class="org-ul">
<li><a id="org1b40be2"></a>议郎<br />
<div class="outline-text-5" id="text-org1b40be2">
<p>
秩比六百石
</p>
</div>
</li>
<li><a id="orgfd8410a"></a>中郎<br />
<div class="outline-text-5" id="text-orgfd8410a">
<p>
秩比六百石
</p>
</div>
<ul class="org-ul">
<li><a id="orgc09e915"></a>五官、左、右三将<br />
<div class="outline-text-6" id="text-orgc09e915">
<p>
秩皆比二千石
</p>
</div>
</li>
</ul>
</li>
<li><a id="org7e99946"></a>侍郎<br />
<div class="outline-text-5" id="text-org7e99946">
<p>
秩比四百石
</p>
</div>
</li>
<li><a id="org1fe11df"></a>郎中<br />
<div class="outline-text-5" id="text-org1fe11df">
<p>
秩比三百石
</p>
</div>
<ul class="org-ul">
<li><a id="org32b5a9c"></a>车、户、骑三将<br />
<div class="outline-text-6" id="text-org32b5a9c">
<p>
秩皆比千石
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="orgcf94c66"></a>谒者<br />
<div class="outline-text-4" id="text-orgcf94c66">
<p>
掌宾讚受事​员七十人，秩比六百石
</p>
</div>
<ul class="org-ul">
<li><a id="org43b61fa"></a>谒者仆射<br />
<div class="outline-text-5" id="text-org43b61fa">
<p>
秩比千石
</p>
</div>
</li>
</ul>
</li>
<li><a id="org8242310"></a>期门（虎贲郎）<br />
<div class="outline-text-4" id="text-org8242310">
<p>
掌执兵送从。​比郎，无员，多至千人。武帝建元三年初置，平帝元始元年更名虎贲郎。
</p>
</div>
<ul class="org-ul">
<li><a id="org2f24ad5"></a>期门仆射<br />
<div class="outline-text-5" id="text-org2f24ad5">
<p>
秩比千石
</p>
</div>
</li>
<li><a id="org08b762a"></a>虎贲中郎将<br />
<div class="outline-text-5" id="text-org08b762a">
<p>
秩比二千石
</p>
</div>
</li>
</ul>
</li>
<li><a id="org268b2ee"></a>羽林<br />
<div class="outline-text-4" id="text-org268b2ee">
<p>
掌送从，次期门。​羽林有令丞。​武帝太初元年初置，名曰建章营骑，后更名羽林骑。又取从军死事之子孙养羽林，官教以五兵，号曰羽林孤儿。宣帝令中郎将、骑都尉监羽林，秩比二千石。
</p>
</div>
</li>
</ul>
</li>
<li><a id="orgd7dbd4a"></a>卫尉（中大夫令）<br />
<div class="outline-text-3" id="text-orgd7dbd4a">
<p>
秦官​掌宫门卫屯兵，有丞。​景帝初更名中大夫令，后元年复为卫尉。
</p>
</div>
<ul class="org-ul">
<li><a id="org114c434"></a>公车司马<br /></li>
<li><a id="org097d618"></a>卫士<br /></li>
<li><a id="org803eaed"></a>旅贲<br /></li>
<li><a id="org988322a"></a>诸屯卫候<br /></li>
<li><a id="orgc151898"></a>司马二十二官<br /></li>
<li><a id="org95ce2e7"></a>长乐卫尉<br /></li>
<li><a id="org2539468"></a>建章卫尉<br /></li>
<li><a id="org4e6f2dc"></a>甘泉卫尉<br /></li>
</ul>
</li>
<li><a id="org3aa930c"></a>太仆<br />
<div class="outline-text-3" id="text-org3aa930c">
<p>
秦官​掌舆马，有两丞。​​秩中二千石。
</p>
</div>
<ul class="org-ul">
<li><a id="orga7f956c"></a>太厩<br />
<div class="outline-text-4" id="text-orga7f956c">
<p>
五丞一尉
</p>
</div>
</li>
<li><a id="org696a485"></a>未央<br />
<div class="outline-text-4" id="text-org696a485">
<p>
五丞一尉​未央厩令
</p>
</div>
</li>
<li><a id="orgb8516d0"></a>家马（挏马）<br />
<div class="outline-text-4" id="text-orgb8516d0">
<p>
五丞一尉​主供天子私用，非大祀戎事军国所需，故谓之家马也。​武帝太初元年更名家马为挏马，初置路。
四令丞
</p>
</div>
<ul class="org-ul">
<li><a id="org2094958"></a>车府<br /></li>
<li><a id="orgab1b70c"></a>路<br />
<div class="outline-text-5" id="text-orgab1b70c">
<p>
厩名​，在未央宫。
</p>
</div>
</li>
<li><a id="org03b35f2"></a>骑马<br />
<div class="outline-text-5" id="text-org03b35f2">
<p>
厩名​，在长安城外。
</p>
</div>
</li>
<li><a id="orgab3657c"></a>骏马<br /></li>
</ul>
</li>
<li><a id="org97c6c6e"></a>五监长丞<br />
<div class="outline-text-4" id="text-org97c6c6e">
<p>
龙马、闲驹、橐泉、騊駼、承华龙马，大宛厩也。闲驹，养马之所​。橐泉，厩名，在橐泉宫下。騊駼，厩名，在长安城外。承华，厩名。
</p>
</div>
</li>
<li><a id="org691b9c2"></a>边郡六牧师苑令<br />
<div class="outline-text-4" id="text-org691b9c2">
<p>
陇西、天水、安定、北地、上郡、西河六郡
</p>
</div>
</li>
<li><a id="org9077645"></a>牧橐令丞<br />
<div class="outline-text-4" id="text-org9077645">
<p>
牧养骆驼
</p>
</div>
</li>
<li><a id="orgd9caf24"></a>昆蹄令丞<br />
<div class="outline-text-4" id="text-orgd9caf24">
<p>
良马厩
</p>
</div>
</li>
<li><a id="org79ba0d4"></a>中太仆<br />
<div class="outline-text-4" id="text-org79ba0d4">
<p>
掌皇太后舆马，不常置也。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org6f6978b"></a>廷尉（大理、作士）<br />
<div class="outline-text-3" id="text-org6f6978b">
<p>
秦官​掌刑辟。​​秩中二千石。​有正、左右监，秩皆千石。​景帝中六年更名大理，武帝建元四年复为廷尉。宣帝地节三年初置左右平，秩皆六百石。帝元寿二年复为大理。王莽改曰作士。
</p>
</div>
</li>
<li><a id="orga5eb237"></a>典客（大行令、大鸿胪、典乐）<br />
<div class="outline-text-3" id="text-orga5eb237">
<p>
秦官​掌诸归义蛮夷，有丞。​​秩中二千石。​景帝中六年更名大行令，武帝太初元年更名大鸿胪。王莽改大鸿胪曰典乐。
</p>
</div>
<ul class="org-ul">
<li><a id="org2ef99f1"></a>行人<br />
<div class="outline-text-4" id="text-org2ef99f1">
<p>
武帝太初元年更名行人为大行令
</p>
</div>
</li>
<li><a id="org9cad6ab"></a>译官<br /></li>
<li><a id="orgfd9b241"></a>别火<br />
<div class="outline-text-4" id="text-orgfd9b241">
<p>
狱令，主治改火之事。​武帝太初元年，初置别火。
</p>
</div>
</li>
<li><a id="org9c17c20"></a>郡邸长丞<br />
<div class="outline-text-4" id="text-org9c17c20">
<p>
诸郡在京师之邸，郡国朝宿之舍。​初，置郡国邸属少府，中属中尉，后属大鸿胪。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org8fc7126"></a>宗正<br />
<div class="outline-text-3" id="text-org8fc7126">
<p>
秦官​掌亲属，有丞。​​秩中二千石。​平帝元始四年更名宗伯。​王莽并其官于秩宗。
</p>
</div>
<ul class="org-ul">
<li><a id="orgf31bc68"></a>都司空令丞<br />
<div class="outline-text-4" id="text-orgf31bc68">
<p>
都造砖瓦，用以修葺宫殿及各城门楼
</p>
</div>
</li>
<li><a id="org97f3dc2"></a>内官长丞<br />
<div class="outline-text-4" id="text-org97f3dc2">
<p>
初，内官属少府，中属主爵，后属宗正。
</p>
</div>
</li>
<li><a id="orgf7fb46c"></a>公主家令<br /></li>
<li><a id="org846a084"></a>公主门尉<br /></li>
</ul>
</li>
<li><a id="org997594e"></a>治粟内史（大农令、大司农）<br />
<div class="outline-text-3" id="text-org997594e">
<p>
秦官。​掌谷货，有两丞。​​秩中二千石。​景帝后元年更名大农令，武帝太初元年更名大司农。王莽改大司农曰羲和，后更为纳言。
</p>
</div>
<ul class="org-ul">
<li><a id="org893e1ba"></a>五令丞<br />
<ul class="org-ul">
<li><a id="org77c5e5a"></a>太仓<br />
<div class="outline-text-5" id="text-org77c5e5a">
<p>
京城储粮大仓
</p>
</div>
</li>
<li><a id="org343deae"></a>均输<br />
<div class="outline-text-5" id="text-org343deae">
<p>
统一征收，买卖和运输货物，以调剂各地需求，郡国设均输官。
</p>
</div>
</li>
<li><a id="orgdf8f356"></a>平准<br />
<div class="outline-text-5" id="text-orgdf8f356">
<p>
官府转输物资，平抑物价，由平准令掌管。
</p>
</div>
</li>
<li><a id="orgcd8780d"></a>都内<br />
<div class="outline-text-5" id="text-orgcd8780d">
<p>
主管贡献方物及货币
</p>
</div>
</li>
<li><a id="org517cac6"></a>籍田<br />
<div class="outline-text-5" id="text-org517cac6">
<p>
初为帝王亲耕，并设仓，后因仓设官。
</p>
</div>
</li>
</ul>
</li>
<li><a id="orgd000c1f"></a>两长丞<br />
<ul class="org-ul">
<li><a id="org5229f01"></a>干官<br />
<div class="outline-text-5" id="text-org5229f01">
<p>
掌铸钱事。​初，斡官属少府，中属主爵，后属大司农。
</p>
</div>
</li>
<li><a id="org917df73"></a>铁市<br /></li>
</ul>
</li>
<li><a id="orgea785d7"></a>郡国诸仓<br /></li>
<li><a id="orgb1914cd"></a>农监<br /></li>
<li><a id="org793950d"></a>都水六十五官长丞<br /></li>
<li><a id="orge5caf81"></a>搜粟都尉<br />
<div class="outline-text-4" id="text-orge5caf81">
<p>
武帝军官，不常置。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org7661360"></a>少府<br />
<div class="outline-text-3" id="text-org7661360">
<p>
秦官​掌山海池泽之税，以给供养，有六丞。​​秩中二千石。​王莽改少府曰共工。
</p>
</div>
<ul class="org-ul">
<li><a id="orgcad5950"></a>十六官令丞<br />
<ul class="org-ul">
<li><a id="org5dcd73f"></a>尚书<br />
<div class="outline-text-5" id="text-org5dcd73f">
<p>
初掌殿内文书，后掌群臣章奏。
</p>
</div>
</li>
<li><a id="org7b461c2"></a>符节<br />
<div class="outline-text-5" id="text-org7b461c2">
<p>
掌符节之事。
</p>
</div>
</li>
<li><a id="org8616925"></a>太医<br />
<div class="outline-text-5" id="text-org8616925">
<p>
主治宫廷人员之病。
</p>
</div>
</li>
<li><a id="org37374c5"></a>太官<br />
<div class="outline-text-5" id="text-org37374c5">
<p>
掌膳食，兼掌四时进献果实。​太官七丞。
</p>
</div>
</li>
<li><a id="orgfe58016"></a>汤官<br />
<div class="outline-text-5" id="text-orgfe58016">
<p>
供饼饵果实。
</p>
</div>
</li>
<li><a id="orgd94cd98"></a>导官<br />
<div class="outline-text-5" id="text-orgd94cd98">
<p>
掌御用粮食。
</p>
</div>
</li>
<li><a id="org8848a29"></a>乐府<br />
<div class="outline-text-5" id="text-org8848a29">
<p>
主管宫廷、巡行、祭祀之音乐，兼采民歌及配曲。​乐府三丞。​绥和二年，哀帝省乐府。
</p>
</div>
</li>
