src/Notes/汉书百官公卿表.org
**** 考工室
主作兵器弓弩及织绶诸杂工。​武帝太初元年更名考工室为考工。
**** 左弋
掌助弋射之事，兼造兵器。​武帝太初元年更名左弋为飞（次蜚）。​飞掌弋射，有九丞两尉。
**** 居室
拘禁犯人之所。​武帝太初元年更名居室为保宫
**** 甘泉居室
武帝太初元年更名为昆台。​昆台五丞。
**** 左右司空
主造陶瓦，兼石刻工艺。
**** 东织
**** 西织
掌皇家丝帛织造，在未央宫。​河平元年省东织，更名西织为织室。
**** 东园匠
掌陵墓内器物制作和供应。
*** 三长丞
**** 庖人
掌宰割者。
**** 都水
掌陂泽。
**** 均官
掌少府均输事。
*** 上林中十池监
*** 八官食丞
**** 中书谒者令
掌机要，由宦者充任。​成帝建始四年更名中书谒者令为中谒者令，初置尚书，员五人，有四丞。
**** 黄门令
主省中诸宦者
**** 鉤盾令
宦者典诸近池苑囿游观之处。​钩盾五丞两尉
**** 尚方令
掌管供应制造帝王所用器物。
**** 御府令
宦者典宫婢作中衣服及补浣之属。
**** 永巷令
宦者典宫婢侍使。​武帝太初元年更名永巷为掖庭。​掖廷八丞。
**** 内者令
掌客庭布张诸衣物。
**** 宦者令
管内廷宦者。​宦者七丞。
*** 仆射
首长之义。秦汉时凡侍中、尚书、博士、谒者、郎等官，都有仆射。
*** 署长
*** 中黄门
宦者掌给事中
* 中尉（执金吾）

秦官​掌徼循京师。​秩中二千石。​有两丞、候、司马、千人。​武帝太初元年更名执金吾。
** 四令丞
*** 中垒
​两尉
*** 寺互
初，寺互属少府，中属主爵，后属中尉。
*** 武库
三丞
*** 都船
主船之官。​三丞
** 式道左右中侯
凡左、右、中三侯车驾出，掌在前清道。车驾还，持麾至宫门，门乃开。
** 侯丞
** 左右京辅都尉
** 尉丞兵卒
* 太子太傅、少傅
古官。
** 太子门大夫
** 率更令
主庶子舍人更值。
** 家令
主仓狱。
** 家府
比二千石。
** 仆
主马。
** 庶子
秩四百石，如中郎，无员。
** 先马
前驱也。
** 舍人
* 将作少府（将作大匠）
秦官​掌治宫室。​有两丞、左右中候。​景帝中六年更名将作大匠。
** 七令丞
*** 石库
*** 东园主章
掌大材，以供东园大匠。​武帝太初元年更名东园主章为木工。
*** 左右前后中校
成帝阳朔三年省中候及左右前后中校五丞。
** 主章长丞
* 詹事
秦官。​掌皇后、太子家，有丞。​成帝鸿嘉三年省詹事官，并属大长秋。
** 太子率更
掌知漏刻，秩千石。
** 家令
主仓狱，秩千石。
** 仆
** 中盾
** 卫率
** 厨厩长丞
** 诸宦官
皇后属官，统称为中官。
** 长信詹事
掌皇太后宫。以太后所居宫为名。​景帝中六年更名长信少府，平帝元始四年更名长乐少府。
* 将行（大长秋）
秦官。​景帝中六年更名大长秋，或用中人，或用士人。
* 典属国
秦官。​掌蛮夷降者。​武帝元狩三年昆邪王降，复增属国，置都尉、丞、侯、千人。
** 九译令
掌翻译。​成帝河平元年省并大鸿胪。
* 水衡都尉
掌上林苑，有五丞。​武帝元鼎二年初置。​王莽改水衡都尉曰予虞。
** 九官令丞
*** 上林
​初属少府。
*** 均输
掌上林苑中均输之事。
*** 御羞
掌帝王膳馐原料。​初属少府。
*** 禁圃
掌禁苑种植事宜。
*** 楫櫂
掌船之官。
*** 钟官
主铸钱之官。
*** 技巧
主刻范。​成帝建始二年省
*** 六厩
成帝建始二年省
*** 辩铜
主原料。
** 衡官
主平其税人。​​初属少府。
** 水司空
** 都水农仓
掌上林苑中农仓。
** 甘泉上林都水七官丞
上林有八丞十二尉，均输四丞，御羞两丞，都水三丞，禁圃两尉，甘泉上林四丞。
* 三辅
元鼎四年更置三辅都尉、都尉丞各一人。
** 内史
周官，秦因之。​掌治京师。​景帝二年分置左右内史。
*** 左内史（左冯翊）
**** 廪栖令丞尉
掌祭祀牺牲之属。
**** 左都水
**** 铁官
**** 云垒
**** 长安四市四长丞
*** 右内史（京兆尹）
右内史武帝太初元年更名京兆尹。
**** 两令丞
***** 长安令丞
***** 厨令丞
掌帝王巡幸境内离宫别馆时之供帐。
**** 两长丞
***** 都水
***** 铁官
** 主爵中尉（都尉、右扶风）
秦官。​掌列侯。​景帝中六年更名都尉，武帝太初元年更名右扶风。治内史右地。列侯更属大鸿胪。
*** 掌畜令丞
*** 四长丞
**** 右都水
**** 铁官
**** 厩
**** 雍厨
* 武职
** 前后左右将军
周末官，秦因之。​金印紫绶。皆掌兵及四夷。​有长史，秩千石。​皆周末官，秦因之，位上卿。汉不常置。或有前后，或有左右。
** 护军都尉（司寇）
秦官。​武帝元狩四年属大司马，成帝绥和元年居大司马府比司直，哀帝元寿元年更名司寇，平帝元始元年更名护军。
** 司隶校尉
周官。​武帝征和四年初置。持节，从中都官徒千二百人，捕巫蛊，督大奸猾。后罢其兵，察三辅、三河、弘农。元帝初元四年去节，成帝元延四年省。绥和二年，哀帝复置，但为司隶，属大司空，比司直。
** 城门校尉
掌京师城门屯兵。​有司马、十二城门候。
** 八校尉
武帝初置，有丞、司马。
*** 中垒校尉
掌北军垒门内，外掌西域。
*** 屯骑校尉
掌骑士。
*** 步兵校尉
掌上林苑门屯兵。
*** 越骑校尉越骑。
*** 长水校尉
掌长水宣曲胡骑。
*** 胡骑校尉
掌池阳胡骑，不常置。
*** 射声校尉
掌待诏射声士。
*** 虎贲校尉
掌轻车。​
** 西域都护加官
宣帝地节二年初置，以骑都尉、谏大夫使护西域三十六国，有副校尉，秩比二千石，丞一人，司马、侯、千人各二人。
** 戊已校尉
掌西域屯田事务。​元帝初元元年置，有丞、司马各一人，侯五人，秩比六百石。
** 奉车都尉
掌御乘舆车。​武帝初置，秩比二千石。
** 驸马都尉
掌驸马。​武帝初置，秩比二千石。
* 中朝官（内朝官）
** 侍中
得入禁中。
** 左右曹诸吏
诸曹受尚书事，诸吏得举法。
** 散骑
散骑骑马，并乘舆车，献可替否。
** 中常侍
得入禁中。
** 给事中
掌顾问应对，位次中常侍。
