Blog/汉书百官公卿表.html
<li><a id="orgc807b6b"></a>若庐<br />
<div class="outline-text-5" id="text-orgc807b6b">
<p>
主治库兵及诏狱。
</p>
</div>
</li>
<li><a id="org77500f0"></a>考工室<br />
<div class="outline-text-5" id="text-org77500f0">
<p>
主作兵器弓弩及织绶诸杂工。​武帝太初元年更名考工室为考工。
</p>
</div>
</li>
<li><a id="org6f5686e"></a>左弋<br />
<div class="outline-text-5" id="text-org6f5686e">
<p>
掌助弋射之事，兼造兵器。​武帝太初元年更名左弋为飞（次蜚）。​飞掌弋射，有九丞两尉。
</p>
</div>
</li>
<li><a id="org6c3fb4d"></a>居室<br />
<div class="outline-text-5" id="text-org6c3fb4d">
<p>
拘禁犯人之所。​武帝太初元年更名居室为保宫
</p>
</div>
</li>
<li><a id="orga8b311b"></a>甘泉居室<br />
<div class="outline-text-5" id="text-orga8b311b">
<p>
武帝太初元年更名为昆台。​昆台五丞。
</p>
</div>
</li>
<li><a id="org7bc84d2"></a>左右司空<br />
<div class="outline-text-5" id="text-org7bc84d2">
<p>
主造陶瓦，兼石刻工艺。
</p>
</div>
</li>
<li><a id="orgd6a301e"></a>东织<br /></li>
<li><a id="orgae08341"></a>西织<br />
<div class="outline-text-5" id="text-orgae08341">
<p>
掌皇家丝帛织造，在未央宫。​河平元年省东织，更名西织为织室。
</p>
</div>
</li>
<li><a id="org5f625f2"></a>东园匠<br />
<div class="outline-text-5" id="text-org5f625f2">
<p>
掌陵墓内器物制作和供应。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org80c5db6"></a>三长丞<br />
<ul class="org-ul">
<li><a id="orgc4cc4fb"></a>庖人<br />
<div class="outline-text-5" id="text-orgc4cc4fb">
<p>
掌宰割者。
</p>
</div>
</li>
<li><a id="org6b850ad"></a>都水<br />
<div class="outline-text-5" id="text-org6b850ad">
<p>
掌陂泽。
</p>
</div>
</li>
<li><a id="org80f9a06"></a>均官<br />
<div class="outline-text-5" id="text-org80f9a06">
<p>
掌少府均输事。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org0d51625"></a>上林中十池监<br /></li>
<li><a id="orga79c5b7"></a>八官食丞<br />
<ul class="org-ul">
<li><a id="org3931a98"></a>中书谒者令<br />
<div class="outline-text-5" id="text-org3931a98">
<p>
掌机要，由宦者充任。​成帝建始四年更名中书谒者令为中谒者令，初置尚书，员五人，有四丞。
</p>
</div>
</li>
<li><a id="orgd7ebcb1"></a>黄门令<br />
<div class="outline-text-5" id="text-orgd7ebcb1">
<p>
主省中诸宦者
</p>
</div>
</li>
<li><a id="orgfed794e"></a>鉤盾令<br />
<div class="outline-text-5" id="text-orgfed794e">
<p>
宦者典诸近池苑囿游观之处。​钩盾五丞两尉
</p>
</div>
</li>
<li><a id="orgdf10bb3"></a>尚方令<br />
<div class="outline-text-5" id="text-orgdf10bb3">
<p>
掌管供应制造帝王所用器物。
</p>
</div>
</li>
<li><a id="orgbd638e0"></a>御府令<br />
<div class="outline-text-5" id="text-orgbd638e0">
<p>
宦者典宫婢作中衣服及补浣之属。
</p>
</div>
</li>
<li><a id="orgc93ddb3"></a>永巷令<br />
<div class="outline-text-5" id="text-orgc93ddb3">
<p>
宦者典宫婢侍使。​武帝太初元年更名永巷为掖庭。​掖廷八丞。
</p>
</div>
</li>
<li><a id="org062b68d"></a>内者令<br />
<div class="outline-text-5" id="text-org062b68d">
<p>
掌客庭布张诸衣物。
</p>
</div>
</li>
<li><a id="orga8642e0"></a>宦者令<br />
<div class="outline-text-5" id="text-orga8642e0">
<p>
管内廷宦者。​宦者七丞。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org3aa4cac"></a>仆射<br />
<div class="outline-text-4" id="text-org3aa4cac">
<p>
首长之义。秦汉时凡侍中、尚书、博士、谒者、郎等官，都有仆射。
</p>
</div>
</li>
<li><a id="org252e2a7"></a>署长<br /></li>
<li><a id="org2df2f8c"></a>中黄门<br />
<div class="outline-text-4" id="text-org2df2f8c">
<p>
宦者掌给事中
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org1b6e2af" class="outline-2">
<h2 id="org1b6e2af">中尉（执金吾）</h2>
<div class="outline-text-2" id="text-org1b6e2af">
<p>
秦官​掌徼循京师。​秩中二千石。​有两丞、候、司马、千人。​武帝太初元年更名执金吾。
</p>
</div>
<ul class="org-ul">
<li><a id="orgdc87ad4"></a>四令丞<br />
<ul class="org-ul">
<li><a id="org935f925"></a>中垒<br />
<div class="outline-text-4" id="text-org935f925">
<p>
​两尉
</p>
</div>
</li>
<li><a id="org8fde216"></a>寺互<br />
<div class="outline-text-4" id="text-org8fde216">
<p>
初，寺互属少府，中属主爵，后属中尉。
</p>
</div>
</li>
<li><a id="orgeed8ddc"></a>武库<br />
<div class="outline-text-4" id="text-orgeed8ddc">
<p>
三丞
</p>
</div>
</li>
<li><a id="org63fabb3"></a>都船<br />
<div class="outline-text-4" id="text-org63fabb3">
<p>
主船之官。​三丞
</p>
</div>
</li>
</ul>
</li>
<li><a id="org5fa4000"></a>式道左右中侯<br />
<div class="outline-text-3" id="text-org5fa4000">
<p>
凡左、右、中三侯车驾出，掌在前清道。车驾还，持麾至宫门，门乃开。
</p>
</div>
</li>
<li><a id="orgcb3daa8"></a>侯丞<br /></li>
<li><a id="orga25550a"></a>左右京辅都尉<br /></li>
<li><a id="org890500a"></a>尉丞兵卒<br /></li>
</ul>
</div>
<div id="outline-container-orgbd669e8" class="outline-2">
<h2 id="orgbd669e8">太子太傅、少傅</h2>
<div class="outline-text-2" id="text-orgbd669e8">
<p>
古官。
</p>
</div>
<ul class="org-ul">
<li><a id="orgfcb7037"></a>太子门大夫<br /></li>
<li><a id="orgd37395b"></a>率更令<br />
<div class="outline-text-3" id="text-orgd37395b">
<p>
主庶子舍人更值。
</p>
</div>
</li>
<li><a id="orge16aec7"></a>家令<br />
<div class="outline-text-3" id="text-orge16aec7">
<p>
主仓狱。
</p>
</div>
</li>
<li><a id="org471c0c9"></a>家府<br />
<div class="outline-text-3" id="text-org471c0c9">
<p>
比二千石。
</p>
</div>
</li>
<li><a id="orgff7933b"></a>仆<br />
<div class="outline-text-3" id="text-orgff7933b">
<p>
主马。
</p>
</div>
</li>
<li><a id="org217aeb0"></a>庶子<br />
<div class="outline-text-3" id="text-org217aeb0">
<p>
秩四百石，如中郎，无员。
</p>
</div>
</li>
<li><a id="org7a64ea4"></a>先马<br />
<div class="outline-text-3" id="text-org7a64ea4">
<p>
前驱也。
</p>
</div>
</li>
<li><a id="org44385d1"></a>舍人<br /></li>
</ul>
</div>
<div id="outline-container-orgf14ca67" class="outline-2">
<h2 id="orgf14ca67">将作少府（将作大匠）</h2>
<div class="outline-text-2" id="text-orgf14ca67">
<p>
秦官​掌治宫室。​有两丞、左右中候。​景帝中六年更名将作大匠。
</p>
</div>
<ul class="org-ul">
<li><a id="org334f50f"></a>七令丞<br />
<ul class="org-ul">
<li><a id="org7ca87f2"></a>石库<br /></li>
<li><a id="org1718240"></a>东园主章<br />
<div class="outline-text-4" id="text-org1718240">
<p>
掌大材，以供东园大匠。​武帝太初元年更名东园主章为木工。
</p>
</div>
</li>
<li><a id="orga42ae41"></a>左右前后中校<br />
<div class="outline-text-4" id="text-orga42ae41">
<p>
成帝阳朔三年省中候及左右前后中校五丞。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org09274fb"></a>主章长丞<br /></li>
</ul>
</div>
<div id="outline-container-org444e160" class="outline-2">
<h2 id="org444e160">詹事</h2>
<div class="outline-text-2" id="text-org444e160">
<p>
秦官。​掌皇后、太子家，有丞。​成帝鸿嘉三年省詹事官，并属大长秋。
</p>
</div>
<ul class="org-ul">
<li><a id="org8c42ff7"></a>太子率更<br />
<div class="outline-text-3" id="text-org8c42ff7">
<p>
掌知漏刻，秩千石。
</p>
</div>
</li>
<li><a id="org539d831"></a>家令<br />
<div class="outline-text-3" id="text-org539d831">
<p>
主仓狱，秩千石。
</p>
</div>
</li>
<li><a id="org6160141"></a>仆<br /></li>
<li><a id="org905ff1a"></a>中盾<br /></li>
<li><a id="org510b071"></a>卫率<br /></li>
<li><a id="org4ccee69"></a>厨厩长丞<br /></li>
<li><a id="org0effe2b"></a>诸宦官<br />
<div class="outline-text-3" id="text-org0effe2b">
<p>
皇后属官，统称为中官。
</p>
</div>
</li>
<li><a id="orgb9693ed"></a>长信詹事<br />
<div class="outline-text-3" id="text-orgb9693ed">
<p>
掌皇太后宫。以太后所居宫为名。​景帝中六年更名长信少府，平帝元始四年更名长乐少府。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9e15f75" class="outline-2">
<h2 id="org9e15f75">将行（大长秋）</h2>
<div class="outline-text-2" id="text-org9e15f75">
<p>
秦官。​景帝中六年更名大长秋，或用中人，或用士人。
</p>
</div>
</div>
<div id="outline-container-orga0f02f7" class="outline-2">
<h2 id="orga0f02f7">典属国</h2>
<div class="outline-text-2" id="text-orga0f02f7">
<p>
秦官。​掌蛮夷降者。​武帝元狩三年昆邪王降，复增属国，置都尉、丞、侯、千人。
</p>
</div>
<ul class="org-ul">
<li><a id="org1de4c30"></a>九译令<br />
<div class="outline-text-3" id="text-org1de4c30">
<p>
掌翻译。​成帝河平元年省并大鸿胪。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfdb3535" class="outline-2">
<h2 id="orgfdb3535">水衡都尉</h2>
<div class="outline-text-2" id="text-orgfdb3535">
<p>
掌上林苑，有五丞。​武帝元鼎二年初置。​王莽改水衡都尉曰予虞。
</p>
</div>
<ul class="org-ul">
<li><a id="org472f31a"></a>九官令丞<br />
<ul class="org-ul">
<li><a id="org3db685e"></a>上林<br />
<div class="outline-text-4" id="text-org3db685e">
<p>
​初属少府。
</p>
</div>
</li>
<li><a id="orgf969b7a"></a>均输<br />
<div class="outline-text-4" id="text-orgf969b7a">
<p>
掌上林苑中均输之事。
</p>
</div>
</li>
<li><a id="orgb394f79"></a>御羞<br />
<div class="outline-text-4" id="text-orgb394f79">
<p>
掌帝王膳馐原料。​初属少府。
</p>
</div>
</li>
<li><a id="org80bf30b"></a>禁圃<br />
<div class="outline-text-4" id="text-org80bf30b">
<p>
掌禁苑种植事宜。
</p>
</div>
</li>
<li><a id="org0318b2d"></a>楫櫂<br />
<div class="outline-text-4" id="text-org0318b2d">
<p>
掌船之官。
</p>
</div>
</li>
<li><a id="orga044612"></a>钟官<br />
<div class="outline-text-4" id="text-orga044612">
<p>
主铸钱之官。
</p>
</div>
</li>
<li><a id="org6054acb"></a>技巧<br />
<div class="outline-text-4" id="text-org6054acb">
<p>
主刻范。​成帝建始二年省
</p>
</div>
</li>
<li><a id="org4405f3c"></a>六厩<br />
<div class="outline-text-4" id="text-org4405f3c">
<p>
成帝建始二年省
</p>
</div>
</li>
<li><a id="org9fe595d"></a>辩铜<br />
<div class="outline-text-4" id="text-org9fe595d">
<p>
主原料。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org9e60c81"></a>衡官<br />
<div class="outline-text-3" id="text-org9e60c81">
<p>
主平其税人。​​初属少府。
</p>
</div>
</li>
<li><a id="org512d774"></a>水司空<br /></li>
<li><a id="org10a0f1b"></a>都水农仓<br />
<div class="outline-text-3" id="text-org10a0f1b">
<p>
掌上林苑中农仓。
</p>
</div>
</li>
<li><a id="org9bb8775"></a>甘泉上林都水七官丞<br />
<div class="outline-text-3" id="text-org9bb8775">
<p>
上林有八丞十二尉，均输四丞，御羞两丞，都水三丞，禁圃两尉，甘泉上林四丞。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcc6f9ec" class="outline-2">
<h2 id="orgcc6f9ec">三辅</h2>
<div class="outline-text-2" id="text-orgcc6f9ec">
<p>
元鼎四年更置三辅都尉、都尉丞各一人。
</p>
</div>
<ul class="org-ul">
<li><a id="orgac49d6d"></a>内史<br />
<div class="outline-text-3" id="text-orgac49d6d">
<p>
周官，秦因之。​掌治京师。​景帝二年分置左右内史。
</p>
</div>
<ul class="org-ul">
<li><a id="org307bdbd"></a>左内史（左冯翊）<br />
<ul class="org-ul">
<li><a id="org9857e19"></a>廪栖令丞尉<br />
<div class="outline-text-5" id="text-org9857e19">
<p>
掌祭祀牺牲之属。
</p>
</div>
</li>
<li><a id="orgdcc7d0f"></a>左都水<br /></li>
<li><a id="org309bcfb"></a>铁官<br /></li>
<li><a id="org24baddd"></a>云垒<br /></li>
<li><a id="org895633e"></a>长安四市四长丞<br /></li>
</ul>
</li>
<li><a id="org9cda97b"></a>右内史（京兆尹）<br />
<div class="outline-text-4" id="text-org9cda97b">
<p>
右内史武帝太初元年更名京兆尹。
</p>
</div>
<ul class="org-ul">
<li><a id="orgf1251ac"></a>两令丞<br />
<ul class="org-ul">
<li><a id="orgb8cb3b9"></a>长安令丞<br /></li>
<li><a id="orge7a2f2e"></a>厨令丞<br />
<div class="outline-text-6" id="text-orge7a2f2e">
<p>
掌帝王巡幸境内离宫别馆时之供帐。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org511ff57"></a>两长丞<br />
<ul class="org-ul">
<li><a id="org7092033"></a>都水<br /></li>
<li><a id="org79b4c3b"></a>铁官<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="orgd6b6c66"></a>主爵中尉（都尉、右扶风）<br />
<div class="outline-text-3" id="text-orgd6b6c66">
<p>
秦官。​掌列侯。​景帝中六年更名都尉，武帝太初元年更名右扶风。治内史右地。列侯更属大鸿胪。
</p>
</div>
<ul class="org-ul">
<li><a id="org8265709"></a>掌畜令丞<br /></li>
<li><a id="org2032624"></a>四长丞<br />
<ul class="org-ul">
<li><a id="org1498da7"></a>右都水<br /></li>
<li><a id="org251ad0b"></a>铁官<br /></li>
<li><a id="org3793663"></a>厩<br /></li>
<li><a id="org97e4dfc"></a>雍厨<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgbc2ba1b" class="outline-2">
<h2 id="orgbc2ba1b">武职</h2>
<div class="outline-text-2" id="text-orgbc2ba1b">
</div>
<ul class="org-ul">
<li><a id="org94b7c11"></a>前后左右将军<br />
<div class="outline-text-3" id="text-org94b7c11">
<p>
周末官，秦因之。​金印紫绶。皆掌兵及四夷。​有长史，秩千石。​皆周末官，秦因之，位上卿。汉不常置。或有前后，或有左右。
</p>
</div>
</li>
<li><a id="org9d686b4"></a>护军都尉（司寇）<br />
<div class="outline-text-3" id="text-org9d686b4">
<p>
秦官。​武帝元狩四年属大司马，成帝绥和元年居大司马府比司直，哀帝元寿元年更名司寇，平帝元始元年更名护军。
</p>
</div>
</li>
<li><a id="org645191b"></a>司隶校尉<br />
<div class="outline-text-3" id="text-org645191b">
<p>
周官。​武帝征和四年初置。持节，从中都官徒千二百人，捕巫蛊，督大奸猾。后罢其兵，察三辅、三河、弘农。元帝初元四年去节，成帝元延四年省。绥和二年，哀帝复置，但为司隶，属大司空，比司直。
</p>
</div>
</li>
<li><a id="org6751fec"></a>城门校尉<br />
<div class="outline-text-3" id="text-org6751fec">
<p>
掌京师城门屯兵。​有司马、十二城门候。
</p>
</div>
</li>
<li><a id="orgf4bd563"></a>八校尉<br />
<div class="outline-text-3" id="text-orgf4bd563">
<p>
武帝初置，有丞、司马。
</p>
</div>
<ul class="org-ul">
<li><a id="org63d269a"></a>中垒校尉<br />
<div class="outline-text-4" id="text-org63d269a">
<p>
掌北军垒门内，外掌西域。
</p>
</div>
</li>
<li><a id="org1e1a678"></a>屯骑校尉<br />
<div class="outline-text-4" id="text-org1e1a678">
<p>
掌骑士。
</p>
</div>
</li>
<li><a id="org655b648"></a>步兵校尉<br />
<div class="outline-text-4" id="text-org655b648">
<p>
掌上林苑门屯兵。
</p>
</div>
</li>
<li><a id="org3fea0a3"></a>越骑校尉越骑。<br /></li>
<li><a id="orgd21394c"></a>长水校尉<br />
<div class="outline-text-4" id="text-orgd21394c">
<p>
掌长水宣曲胡骑。
</p>
</div>
</li>
<li><a id="orgd124716"></a>胡骑校尉<br />
<div class="outline-text-4" id="text-orgd124716">
<p>
掌池阳胡骑，不常置。
</p>
</div>
</li>
<li><a id="org67bd27c"></a>射声校尉<br />
<div class="outline-text-4" id="text-org67bd27c">
<p>
掌待诏射声士。
</p>
</div>
</li>
<li><a id="orgb5b245d"></a>虎贲校尉<br />
<div class="outline-text-4" id="text-orgb5b245d">
<p>
掌轻车。​
</p>
</div>
</li>
</ul>
</li>
<li><a id="org82bd5c4"></a>西域都护加官<br />
<div class="outline-text-3" id="text-org82bd5c4">
<p>
宣帝地节二年初置，以骑都尉、谏大夫使护西域三十六国，有副校尉，秩比二千石，丞一人，司马、侯、千人各二人。
</p>
</div>
</li>
<li><a id="org58f7360"></a>戊已校尉<br />
<div class="outline-text-3" id="text-org58f7360">
<p>
掌西域屯田事务。​元帝初元元年置，有丞、司马各一人，侯五人，秩比六百石。
</p>
</div>
</li>
<li><a id="org3a25fa1"></a>奉车都尉<br />
<div class="outline-text-3" id="text-org3a25fa1">
<p>
掌御乘舆车。​武帝初置，秩比二千石。
</p>
</div>
</li>
