src/Notes/汉书百官公卿表.org
* 监御史（刺史、牧）
秦官。​掌监郡。​汉省，丞相遣史刺州，不常置。​武帝元封年初置部刺史，掌奉诏条察州，秩六百石，员十三人。​成帝绥和元年更名牧，秩二千石。哀帝建平二年复为刺史，元寿二年复为牧。
* 郡县
** 郡
*** 郡守（太守）
秦官。​掌治其郡，秩二千石。​有丞，边郡又有长史，掌兵马，秩皆六百石。​景帝中二年更名太守。
*** 郡尉（都尉）
秦官。​掌佐守典武职甲卒。​秩比二千石。有丞，秩皆六百石。​景帝中二年更名都尉。
** 边郡
*** 关都尉
秦官。设于扼要之所。​
**** 关长
**** 关尉
**** 关丞
*** 农都尉
主屯田植谷。
*** 属国都尉
安置降附者，掌管属国事务。
** 县
*** 县令、县长
皆秦官。​掌治其县。​万户以上为令，秩千石至六百石。减万户为长，秩五百石至三百石。
**** 长吏
***** 县丞
秩四百石至二百石。
***** 县尉
秩四百石至二百石。
**** 少吏
***** 斗食
百石以下
***** 佐史
*** 亭长
**** 乡
***** 三老
三老掌教化。
***** 有秩
***** 啬夫
啬夫职听论，收赋税。兼为吏民移请过所。手续是由乡到县，经县丞批发。与有秩类似。
***** 游徼
游徼徼循禁贼盗。
** 国、邑、道
列侯所食县曰国，皇太后、皇后、公主所食曰邑，有蛮夷曰道。
