Blog/汉书百官公卿表.html
<li><a id="orgb2bebd9"></a>驸马都尉<br />
<div class="outline-text-3" id="text-orgb2bebd9">
<p>
掌驸马。​武帝初置，秩比二千石。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2271665" class="outline-2">
<h2 id="org2271665">中朝官（内朝官）</h2>
<div class="outline-text-2" id="text-org2271665">
</div>
<ul class="org-ul">
<li><a id="org7e22b68"></a>侍中<br />
<div class="outline-text-3" id="text-org7e22b68">
<p>
得入禁中。
</p>
</div>
</li>
<li><a id="org9af42ee"></a>左右曹诸吏<br />
<div class="outline-text-3" id="text-org9af42ee">
<p>
诸曹受尚书事，诸吏得举法。
</p>
</div>
</li>
<li><a id="org350e7d2"></a>散骑<br />
<div class="outline-text-3" id="text-org350e7d2">
<p>
散骑骑马，并乘舆车，献可替否。
</p>
</div>
</li>
<li><a id="org02d0adb"></a>中常侍<br />
<div class="outline-text-3" id="text-org02d0adb">
<p>
得入禁中。
</p>
</div>
</li>
<li><a id="orgd538e23"></a>给事中<br />
<div class="outline-text-3" id="text-orgd538e23">
<p>
掌顾问应对，位次中常侍。
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd466595" class="outline-2">
<h2 id="orgd466595">监御史（刺史、牧）</h2>
<div class="outline-text-2" id="text-orgd466595">
<p>
秦官。​掌监郡。​汉省，丞相遣史刺州，不常置。​武帝元封年初置部刺史，掌奉诏条察州，秩六百石，员十三人。​成帝绥和元年更名牧，秩二千石。哀帝建平二年复为刺史，元寿二年复为牧。
</p>
</div>
</div>
<div id="outline-container-orga459796" class="outline-2">
<h2 id="orga459796">郡县</h2>
<div class="outline-text-2" id="text-orga459796">
</div>
<ul class="org-ul">
<li><a id="org314c88a"></a>郡<br />
<ul class="org-ul">
<li><a id="org513d539"></a>郡守（太守）<br />
<div class="outline-text-4" id="text-org513d539">
<p>
秦官。​掌治其郡，秩二千石。​有丞，边郡又有长史，掌兵马，秩皆六百石。​景帝中二年更名太守。
</p>
</div>
</li>
<li><a id="org3a8a8c2"></a>郡尉（都尉）<br />
<div class="outline-text-4" id="text-org3a8a8c2">
<p>
秦官。​掌佐守典武职甲卒。​秩比二千石。有丞，秩皆六百石。​景帝中二年更名都尉。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org0b14e37"></a>边郡<br />
<ul class="org-ul">
<li><a id="org659e2c9"></a>关都尉<br />
<div class="outline-text-4" id="text-org659e2c9">
<p>
秦官。设于扼要之所。​
</p>
</div>
<ul class="org-ul">
<li><a id="orgccdb4bf"></a>关长<br /></li>
<li><a id="org10e6bae"></a>关尉<br /></li>
<li><a id="org78e6dbb"></a>关丞<br /></li>
</ul>
</li>
<li><a id="org600ef75"></a>农都尉<br />
<div class="outline-text-4" id="text-org600ef75">
<p>
主屯田植谷。
</p>
</div>
</li>
<li><a id="orgecb4595"></a>属国都尉<br />
<div class="outline-text-4" id="text-orgecb4595">
<p>
安置降附者，掌管属国事务。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org6588c5c"></a>县<br />
<ul class="org-ul">
<li><a id="org7c8960d"></a>县令、县长<br />
<div class="outline-text-4" id="text-org7c8960d">
<p>
皆秦官。​掌治其县。​万户以上为令，秩千石至六百石。减万户为长，秩五百石至三百石。
</p>
</div>
<ul class="org-ul">
<li><a id="orgfad4c76"></a>长吏<br />
<ul class="org-ul">
<li><a id="org5626f03"></a>县丞<br />
<div class="outline-text-6" id="text-org5626f03">
<p>
秩四百石至二百石。
</p>
</div>
</li>
<li><a id="org0d62434"></a>县尉<br />
<div class="outline-text-6" id="text-org0d62434">
<p>
秩四百石至二百石。
</p>
</div>
</li>
</ul>
</li>
<li><a id="org26a954d"></a>少吏<br />
<ul class="org-ul">
<li><a id="orge6c0fa6"></a>斗食<br />
<div class="outline-text-6" id="text-orge6c0fa6">
<p>
百石以下
</p>
</div>
</li>
<li><a id="orgbf1c551"></a>佐史<br /></li>
</ul>
</li>
</ul>
</li>
<li><a id="org16ad378"></a>亭长<br />
<ul class="org-ul">
<li><a id="org3beb955"></a>乡<br />
<ul class="org-ul">
<li><a id="org80fc9d7"></a>三老<br />
<div class="outline-text-6" id="text-org80fc9d7">
<p>
三老掌教化。
</p>
</div>
</li>
<li><a id="org74c20f7"></a>有秩<br /></li>
<li><a id="orga413e01"></a>啬夫<br />
<div class="outline-text-6" id="text-orga413e01">
<p>
啬夫职听论，收赋税。兼为吏民移请过所。手续是由乡到县，经县丞批发。与有秩类似。
</p>
</div>
</li>
<li><a id="orgd9f5677"></a>游徼<br />
<div class="outline-text-6" id="text-orgd9f5677">
<p>
游徼徼循禁贼盗。
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="orgb8441ed"></a>国、邑、道<br />
<div class="outline-text-3" id="text-orgb8441ed">
<p>
列侯所食县曰国，皇太后、皇后、公主所食曰邑，有蛮夷曰道。
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<footer>
</footer>
</div>
</body>
</html>
